In [ ]:
# two types of statics 

# descriptive stastics and inferential stastics

# for the data analsis if conducting experment and you are talking number for a gruop of people is called population
#  whe you are take into account the entire population in data analsysis is called descriptive stastics 
#     and 
# but if you take few sample for analsys and that analys is applied entire population is called inferential stastics

In [15]:
import pandas as pd
import numpy as np

df = pd.read_csv("income.csv", names = ["name" , "income"],skiprows=[0])
df

      name   income
0   sanket     5000
1      raj     6000
2     ravi     4000
3  rushil      7000
4    rajan     8000
5   kartik     7500
6    dhruv  1000000

In [4]:
df.describe()

# mean
# standerd deviation 
# 25th percentile 0.25*7 = 1.75  in between 5000 and 6000 = 5500
# 50th percentale 
# 75th percentile 0.75*7 = 5.25 in between 8000 and 7500 = 8000+7500/2=7750

       monthly income $
count          7.000000
mean      148214.285714
std       375604.829702
min         4000.000000
25%         5500.000000
50%         7000.000000
75%         7750.000000
max      1000000.000000

In [5]:
# interquntail range (IQR) = 75th percentaile- 25th percentaile

# removing outlier

In [18]:
percentile_99 = df.income.quantile(0.99)
percentile_99

940479.9999999995

In [21]:
no_outerline = df[df.income<=percentile_99]

In [22]:
no_outerline

      name  income
0   sanket    5000
1      raj    6000
2     ravi    4000
3  rushil     7000
4    rajan    8000
5   kartik    7500

# dealing with missing data and fill the values

In [24]:
df["income"][3] = np.NaN

C:\Users\sanket vekariya\AppData\Local\Temp\ipykernel_8708\783890398.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["income"][3] = np.NaN

In [25]:
df   rushil has no data found

      name     income
0   sanket     5000.0
1      raj     6000.0
2     ravi     4000.0
3  rushil         NaN
4    rajan     8000.0
5   kartik     7500.0
6    dhruv  1000000.0

In [26]:
# the fill data by the median becuse if we are use mean due to dhruv rushil have large data hence we are use medial

In [27]:
df_new= df.fillna(df.income.median())
df_new

      name     income
0   sanket     5000.0
1      raj     6000.0
2     ravi     4000.0
3  rushil      6750.0
4    rajan     8000.0
5   kartik     7500.0
6    dhruv  1000000.0

In [ ]:
# rushil -> 6750